Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA106.h
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile unsigned int  RPOR12 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR12BITS {
  union {
    struct {
      unsigned RP24R:6;
      unsigned :2;
      unsigned RP25R:6;
    };
    struct {
      unsigned RP24R0:1;
      unsigned RP24R1:1;
      unsigned RP24R2:1;
      unsigned RP24R3:1;
      unsigned RP24R4:1;
      unsigned RP24R5:1;
      unsigned :2;
      unsigned RP25R0:1;
      unsigned RP25R1:1;
      unsigned RP25R2:1;
      unsigned RP25R3:1;
      unsigned RP25R4:1;
      unsigned RP25R5:1;
    };
  };
} RPOR12BITS;
extern volatile RPOR12BITS RPOR12bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile unsigned int  RPOR13 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR13BITS {
  union {
    struct {
      unsigned RP26R:6;
      unsigned :2;
      unsigned RP27R:6;
    };
    struct {
      unsigned RP26R0:1;
      unsigned RP26R1:1;
      unsigned RP26R2:1;
      unsigned RP26R3:1;
      unsigned RP26R4:1;
      unsigned RP26R5:1;
      unsigned :2;
      unsigned RP27R0:1;
      unsigned RP27R1:1;
      unsigned RP27R2:1;
      unsigned RP27R3:1;
      unsigned RP27R4:1;
      unsigned RP27R5:1;
    };
  };
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile unsigned int  RPOR14 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR14BITS {
  union {
    struct {
      unsigned RP28R:6;
      unsigned :2;
      unsigned RP29R:6;
    };
    struct {
      unsigned RP28R0:1;
      unsigned RP28R1:1;
      unsigned RP28R2:1;
      unsigned RP28R3:1;
      unsigned RP28R4:1;
      unsigned RP28R5:1;
      unsigned :2;
      unsigned RP29R0:1;
      unsigned RP29R1:1;
      unsigned RP29R2:1;
      unsigned RP29R3:1;
      unsigned RP29R4:1;
      unsigned RP29R5:1;
    };
  };
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define G1CMDL G1CMDL
extern volatile unsigned int  G1CMDL __attribute__((__sfr__));
typedef struct tagG1CMDLBITS {
  unsigned GCMD0:1;
  unsigned GCMD1:1;
  unsigned GCMD2:1;
  unsigned GCMD3:1;
  unsigned GCMD4:1;
  unsigned GCMD5:1;
  unsigned GCMD6:1;
  unsigned GCMD7:1;
  unsigned GCMD8:1;
  unsigned GCMD9:1;
  unsigned GCMD10:1;
  unsigned GCMD11:1;
  unsigned GCMD12:1;
  unsigned GCMD13:1;
  unsigned GCMD14:1;
  unsigned GCMD15:1;
} G1CMDLBITS;
extern volatile G1CMDLBITS G1CMDLbits __attribute__((__sfr__));

#define G1CMDH G1CMDH
extern volatile unsigned int  G1CMDH __attribute__((__sfr__));
typedef struct tagG1CMDHBITS {
  unsigned GCMD16:1;
  unsigned GCMD17:1;
  unsigned GCMD18:1;
  unsigned GCMD19:1;
  unsigned GCMD20:1;
  unsigned GCMD21:1;
  unsigned GCMD22:1;
  unsigned GCMD23:1;
  unsigned GCMD24:1;
  unsigned GCMD25:1;
  unsigned GCMD26:1;
  unsigned GCMD27:1;
  unsigned GCMD28:1;
  unsigned GCMD29:1;
  unsigned GCMD30:1;
  unsigned GCMD31:1;
} G1CMDHBITS;
extern volatile G1CMDHBITS G1CMDHbits __attribute__((__sfr__));

#define G1CON1 G1CON1
extern volatile unsigned int  G1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagG1CON1BITS {
  union {
    struct {
      unsigned GCMDCNT:5;
      unsigned PUBPP:3;
      unsigned GCMDWMK:5;
      unsigned G1SIDL:1;
      unsigned :1;
      unsigned G1EN:1;
    };
    struct {
      unsigned GCMDCNT0:1;
      unsigned GCMDCNT1:1;
      unsigned GCMDCNT2:1;
      unsigned GCMDCNT3:1;
      unsigned GCMDCNT4:1;
      unsigned PUBPP0:1;
      unsigned PUBPP1:1;
      unsigned PUBPP2:1;
      unsigned GCMDWMK0:1;
      unsigned GCMDWMK1:1;
      unsigned GCMDWMK2:1;
      unsigned GCMDWMK3:1;
      unsigned GCMDWMK4:1;
    };
  };
} G1CON1BITS;
extern volatile G1CON1BITS G1CON1bits __attribute__((__sfr__));

#define G1STAT G1STAT
extern volatile unsigned int  G1STAT __attribute__((__sfr__));
typedef struct tagG1STATBITS {
  unsigned CMDMPT:1;
  unsigned CMDFUL:1;
  unsigned CMDLV:1;
  unsigned HMRGN:1;
  unsigned VMRGN:1;
  unsigned CHRBUSY:1;
  unsigned RCCBUSY:1;
  unsigned IPUBUSY:1;
  unsigned :7;
  unsigned PUBUSY:1;
} G1STATBITS;
extern volatile G1STATBITS G1STATbits __attribute__((__sfr__));

#define G1IE G1IE
extern volatile unsigned int  G1IE __attribute__((__sfr__));
typedef struct tagG1IEBITS {
  unsigned CMDMPTIE:1;
  unsigned CMDFULIE:1;
  unsigned CMDLVIE:1;
  unsigned HMRGNIE:1;
  unsigned VMRGNIE:1;
  unsigned CHRIE:1;
  unsigned RCCIE:1;
  unsigned IPUIE:1;
  unsigned :7;
  unsigned PUIE:1;
} G1IEBITS;
extern volatile G1IEBITS G1IEbits __attribute__((__sfr__));

#define G1IR G1IR
extern volatile unsigned int  G1IR __attribute__((__sfr__));
typedef struct tagG1IRBITS {
  unsigned CMDMPTIF:1;
  unsigned CMDFULIF:1;
  unsigned CMDLVIF:1;
  unsigned HMRGNIF:1;
  unsigned VMRGNIF:1;
  unsigned CHRIF:1;
  unsigned RCCIF:1;
  unsigned IPUIF:1;
  unsigned :7;
  unsigned PUIF:1;
} G1IRBITS;
extern volatile G1IRBITS G1IRbits __attribute__((__sfr__));

#define G1W1ADRL G1W1ADRL
extern volatile unsigned int  G1W1ADRL __attribute__((__sfr__));
typedef struct tagG1W1ADRLBITS {
  unsigned W1ADR0:1;
  unsigned W1ADR1:1;
  unsigned W1ADR2:1;
  unsigned W1ADR3:1;
  unsigned W1ADR4:1;
  unsigned W1ADR5:1;
  unsigned W1ADR6:1;
  unsigned W1ADR7:1;
  unsigned W1ADR8:1;
  unsigned W1ADR9:1;
  unsigned W1ADR10:1;
  unsigned W1ADR11:1;
  unsigned W1ADR12:1;
  unsigned W1ADR13:1;
  unsigned W1ADR14:1;
  unsigned W1ADR15:1;
} G1W1ADRLBITS;
extern volatile G1W1ADRLBITS G1W1ADRLbits __attribute__((__sfr__));

#define G1W1ADRH G1W1ADRH
extern volatile unsigned int  G1W1ADRH __attribute__((__sfr__));
typedef struct tagG1W1ADRHBITS {
  unsigned W1ADR16:1;
  unsigned W1ADR17:1;
  unsigned W1ADR18:1;
  unsigned W1ADR19:1;
  unsigned W1ADR20:1;
  unsigned W1ADR21:1;
  unsigned W1ADR22:1;
  unsigned W1ADR23:1;
} G1W1ADRHBITS;
extern volatile G1W1ADRHBITS G1W1ADRHbits __attribute__((__sfr__));

#define G1W2ADRL G1W2ADRL
extern volatile unsigned int  G1W2ADRL __attribute__((__sfr__));
typedef struct tagG1W2ADRLBITS {
  unsigned W2ADR0:1;
  unsigned W2ADR1:1;
  unsigned W2ADR2:1;
  unsigned W2ADR3:1;
  unsigned W2ADR4:1;
  unsigned W2ADR5:1;
  unsigned W2ADR6:1;
  unsigned W2ADR7:1;
  unsigned W2ADR8:1;
  unsigned W2ADR9:1;
  unsigned W2ADR10:1;
  unsigned W2ADR11:1;
  unsigned W2ADR12:1;
  unsigned W2ADR13:1;
  unsigned W2ADR14:1;
  unsigned W2ADR15:1;
} G1W2ADRLBITS;
