Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA106.h
extern volatile G1HSYNCBITS G1HSYNCbits __attribute__((__sfr__));

#define G1VSYNC G1VSYNC
extern volatile unsigned int  G1VSYNC __attribute__((__sfr__));
__extension__ typedef struct tagG1VSYNCBITS {
  union {
    struct {
      unsigned VSST:8;
      unsigned VSLEN:8;
    };
    struct {
      unsigned VSST0:1;
      unsigned VSST1:1;
      unsigned VSST2:1;
      unsigned VSST3:1;
      unsigned VSST4:1;
      unsigned VSST5:1;
      unsigned VSST6:1;
      unsigned VSST7:1;
      unsigned VSLEN0:1;
      unsigned VSLEN1:1;
      unsigned VSLEN2:1;
      unsigned VSLEN3:1;
      unsigned VSLEN4:1;
      unsigned VSLEN5:1;
      unsigned VSLEN6:1;
      unsigned VSLEN7:1;
    };
  };
} G1VSYNCBITS;
extern volatile G1VSYNCBITS G1VSYNCbits __attribute__((__sfr__));

#define G1DBLCON G1DBLCON
extern volatile unsigned int  G1DBLCON __attribute__((__sfr__));
__extension__ typedef struct tagG1DBLCONBITS {
  union {
    struct {
      unsigned HENST:8;
      unsigned VENST:8;
    };
    struct {
      unsigned HENST0:1;
      unsigned HENST1:1;
      unsigned HENST2:1;
      unsigned HENST3:1;
      unsigned HENST4:1;
      unsigned HENST5:1;
      unsigned HENST6:1;
      unsigned HENST7:1;
      unsigned VENST0:1;
      unsigned VENST1:1;
      unsigned VENST2:1;
      unsigned VENST3:1;
      unsigned VENST4:1;
      unsigned VENST5:1;
      unsigned VENST6:1;
      unsigned VENST7:1;
    };
  };
} G1DBLCONBITS;
extern volatile G1DBLCONBITS G1DBLCONbits __attribute__((__sfr__));

#define G1CLUT G1CLUT
extern volatile unsigned int  G1CLUT __attribute__((__sfr__));
__extension__ typedef struct tagG1CLUTBITS {
  union {
    struct {
      unsigned CLUTADR:8;
      unsigned CLUTRWEN:1;
      unsigned CLUTTRD:1;
      unsigned :4;
      unsigned CLUTBUSY:1;
      unsigned CLUTEN:1;
    };
    struct {
      unsigned CLUTADR0:1;
      unsigned CLUTADR1:1;
      unsigned CLUTADR2:1;
      unsigned CLUTADR3:1;
      unsigned CLUTADR4:1;
      unsigned CLUTADR5:1;
      unsigned CLUTADR6:1;
      unsigned CLUTADR7:1;
    };
  };
} G1CLUTBITS;
extern volatile G1CLUTBITS G1CLUTbits __attribute__((__sfr__));

#define G1CLUTWR G1CLUTWR
extern volatile unsigned int  G1CLUTWR __attribute__((__sfr__));
__extension__ typedef struct tagG1CLUTWRBITS {
  union {
    struct {
      unsigned CLUTWR:16;
    };
    struct {
      unsigned CLUTWR0:1;
      unsigned CLUTWR1:1;
      unsigned CLUTWR2:1;
      unsigned CLUTWR3:1;
      unsigned CLUTWR4:1;
      unsigned CLUTWR5:1;
      unsigned CLUTWR6:1;
      unsigned CLUTWR7:1;
      unsigned CLUTWR8:1;
      unsigned CLUTWR9:1;
      unsigned CLUTWR10:1;
      unsigned CLUTWR11:1;
      unsigned CLUTWR12:1;
      unsigned CLUTWR13:1;
      unsigned CLUTWR14:1;
      unsigned CLUTWR15:1;
    };
  };
} G1CLUTWRBITS;
extern volatile G1CLUTWRBITS G1CLUTWRbits __attribute__((__sfr__));

#define G1CLUTRD G1CLUTRD
extern volatile unsigned int  G1CLUTRD __attribute__((__sfr__));
__extension__ typedef struct tagG1CLUTRDBITS {
  union {
    struct {
      unsigned CLUTRD:16;
    };
    struct {
      unsigned CLUTRD0:1;
      unsigned CLUTRD1:1;
      unsigned CLUTRD2:1;
      unsigned CLUTRD3:1;
      unsigned CLUTRD4:1;
      unsigned CLUTRD5:1;
      unsigned CLUTRD6:1;
      unsigned CLUTRD7:1;
      unsigned CLUTRD8:1;
      unsigned CLUTRD9:1;
      unsigned CLUTRD10:1;
      unsigned CLUTRD11:1;
      unsigned CLUTRD12:1;
      unsigned CLUTRD13:1;
      unsigned CLUTRD14:1;
      unsigned CLUTRD15:1;
    };
  };
} G1CLUTRDBITS;
extern volatile G1CLUTRDBITS G1CLUTRDbits __attribute__((__sfr__));

#define G1MRGN G1MRGN
extern volatile unsigned int  G1MRGN __attribute__((__sfr__));
__extension__ typedef struct tagG1MRGNBITS {
  union {
    struct {
      unsigned HBAMGN:8;
      unsigned VBAMGN:8;
    };
    struct {
      unsigned HBAMGN0:1;
      unsigned HBAMGN1:1;
      unsigned HBAMGN2:1;
      unsigned HBAMGN3:1;
      unsigned HBAMGN4:1;
      unsigned HBAMGN5:1;
      unsigned HBAMGN6:1;
      unsigned HBAMGN7:1;
      unsigned VBAMGN0:1;
      unsigned VBAMGN1:1;
      unsigned VBAMGN2:1;
      unsigned VBAMGN3:1;
      unsigned VBAMGN4:1;
      unsigned VBAMGN5:1;
      unsigned VBAMGN6:1;
      unsigned VBAMGN7:1;
    };
  };
} G1MRGNBITS;
extern volatile G1MRGNBITS G1MRGNbits __attribute__((__sfr__));

#define G1CHRX G1CHRX
extern volatile unsigned int  G1CHRX __attribute__((__sfr__));
__extension__ typedef struct tagG1CHRXBITS {
  union {
    struct {
      unsigned CURPOSX:11;
    };
    struct {
      unsigned CURPOSX0:1;
      unsigned CURPOSX1:1;
      unsigned CURPOSX2:1;
      unsigned CURPOSX3:1;
      unsigned CURPOSX4:1;
      unsigned CURPOSX5:1;
      unsigned CURPOSX6:1;
      unsigned CURPOSX7:1;
      unsigned CURPOSX8:1;
      unsigned CURPOSX9:1;
      unsigned CURPOSX10:1;
    };
  };
} G1CHRXBITS;
extern volatile G1CHRXBITS G1CHRXbits __attribute__((__sfr__));

#define G1CHRY G1CHRY
extern volatile unsigned int  G1CHRY __attribute__((__sfr__));
__extension__ typedef struct tagG1CHRYBITS {
  union {
    struct {
      unsigned CURPOSY:11;
    };
    struct {
      unsigned CURPOSY0:1;
      unsigned CURPOSY1:1;
      unsigned CURPOSY2:1;
      unsigned CURPOSY3:1;
      unsigned CURPOSY4:1;
      unsigned CURPOSY5:1;
      unsigned CURPOSY6:1;
      unsigned CURPOSY7:1;
      unsigned CURPOSY8:1;
      unsigned CURPOSY9:1;
      unsigned CURPOSY10:1;
    };
  };
} G1CHRYBITS;
extern volatile G1CHRYBITS G1CHRYbits __attribute__((__sfr__));

#define G1IPU G1IPU
extern volatile unsigned int  G1IPU __attribute__((__sfr__));
typedef struct tagG1IPUBITS {
  unsigned BFINAL:1;
  unsigned IPUDONE:1;
  unsigned WRAPERR:1;
  unsigned LENERR:1;
  unsigned BLCKERR:1;
  unsigned HUFFERR:1;
} G1IPUBITS;
extern volatile G1IPUBITS G1IPUbits __attribute__((__sfr__));

#define G1DBEN G1DBEN
extern volatile unsigned int  G1DBEN __attribute__((__sfr__));
__extension__ typedef struct tagG1DBENBITS {
  union {
    struct {
      unsigned GDBEN:16;
    };
    struct {
      unsigned GDBEN0:1;
      unsigned GDBEN1:1;
      unsigned GDBEN2:1;
      unsigned GDBEN3:1;
      unsigned GDBEN4:1;
      unsigned GDBEN5:1;
      unsigned GDBEN6:1;
      unsigned GDBEN7:1;
      unsigned GDBEN8:1;
      unsigned GDBEN9:1;
      unsigned GDBEN10:1;
      unsigned GDBEN11:1;
      unsigned GDBEN12:1;
      unsigned GDBEN13:1;
      unsigned GDBEN14:1;
      unsigned GDBEN15:1;
    };
  };
} G1DBENBITS;
