Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA106.h
#define _G1CON1_GCMDCNT0_POSITION                0x00000000
#define _G1CON1_GCMDCNT0_MASK                    0x00000001
#define _G1CON1_GCMDCNT0_LENGTH                  0x00000001

#define _G1CON1_GCMDCNT1_POSITION                0x00000001
#define _G1CON1_GCMDCNT1_MASK                    0x00000002
#define _G1CON1_GCMDCNT1_LENGTH                  0x00000001

#define _G1CON1_GCMDCNT2_POSITION                0x00000002
#define _G1CON1_GCMDCNT2_MASK                    0x00000004
#define _G1CON1_GCMDCNT2_LENGTH                  0x00000001

#define _G1CON1_GCMDCNT3_POSITION                0x00000003
#define _G1CON1_GCMDCNT3_MASK                    0x00000008
#define _G1CON1_GCMDCNT3_LENGTH                  0x00000001

#define _G1CON1_GCMDCNT4_POSITION                0x00000004
#define _G1CON1_GCMDCNT4_MASK                    0x00000010
#define _G1CON1_GCMDCNT4_LENGTH                  0x00000001

#define _G1CON1_PUBPP0_POSITION                  0x00000005
#define _G1CON1_PUBPP0_MASK                      0x00000020
#define _G1CON1_PUBPP0_LENGTH                    0x00000001

#define _G1CON1_PUBPP1_POSITION                  0x00000006
#define _G1CON1_PUBPP1_MASK                      0x00000040
#define _G1CON1_PUBPP1_LENGTH                    0x00000001

#define _G1CON1_PUBPP2_POSITION                  0x00000007
#define _G1CON1_PUBPP2_MASK                      0x00000080
#define _G1CON1_PUBPP2_LENGTH                    0x00000001

#define _G1CON1_GCMDWMK0_POSITION                0x00000008
#define _G1CON1_GCMDWMK0_MASK                    0x00000100
#define _G1CON1_GCMDWMK0_LENGTH                  0x00000001

#define _G1CON1_GCMDWMK1_POSITION                0x00000009
#define _G1CON1_GCMDWMK1_MASK                    0x00000200
#define _G1CON1_GCMDWMK1_LENGTH                  0x00000001

#define _G1CON1_GCMDWMK2_POSITION                0x0000000A
#define _G1CON1_GCMDWMK2_MASK                    0x00000400
#define _G1CON1_GCMDWMK2_LENGTH                  0x00000001

#define _G1CON1_GCMDWMK3_POSITION                0x0000000B
#define _G1CON1_GCMDWMK3_MASK                    0x00000800
#define _G1CON1_GCMDWMK3_LENGTH                  0x00000001

#define _G1CON1_GCMDWMK4_POSITION                0x0000000C
#define _G1CON1_GCMDWMK4_MASK                    0x00001000
#define _G1CON1_GCMDWMK4_LENGTH                  0x00000001

#define _G1STAT_CMDMPT_POSITION                  0x00000000
#define _G1STAT_CMDMPT_MASK                      0x00000001
#define _G1STAT_CMDMPT_LENGTH                    0x00000001

#define _G1STAT_CMDFUL_POSITION                  0x00000001
#define _G1STAT_CMDFUL_MASK                      0x00000002
#define _G1STAT_CMDFUL_LENGTH                    0x00000001

#define _G1STAT_CMDLV_POSITION                   0x00000002
#define _G1STAT_CMDLV_MASK                       0x00000004
#define _G1STAT_CMDLV_LENGTH                     0x00000001

#define _G1STAT_HMRGN_POSITION                   0x00000003
#define _G1STAT_HMRGN_MASK                       0x00000008
#define _G1STAT_HMRGN_LENGTH                     0x00000001

#define _G1STAT_VMRGN_POSITION                   0x00000004
#define _G1STAT_VMRGN_MASK                       0x00000010
#define _G1STAT_VMRGN_LENGTH                     0x00000001

#define _G1STAT_CHRBUSY_POSITION                 0x00000005
#define _G1STAT_CHRBUSY_MASK                     0x00000020
#define _G1STAT_CHRBUSY_LENGTH                   0x00000001

#define _G1STAT_RCCBUSY_POSITION                 0x00000006
#define _G1STAT_RCCBUSY_MASK                     0x00000040
#define _G1STAT_RCCBUSY_LENGTH                   0x00000001

#define _G1STAT_IPUBUSY_POSITION                 0x00000007
#define _G1STAT_IPUBUSY_MASK                     0x00000080
#define _G1STAT_IPUBUSY_LENGTH                   0x00000001

#define _G1STAT_PUBUSY_POSITION                  0x0000000F
#define _G1STAT_PUBUSY_MASK                      0x00008000
#define _G1STAT_PUBUSY_LENGTH                    0x00000001

#define _G1IE_CMDMPTIE_POSITION                  0x00000000
#define _G1IE_CMDMPTIE_MASK                      0x00000001
#define _G1IE_CMDMPTIE_LENGTH                    0x00000001

#define _G1IE_CMDFULIE_POSITION                  0x00000001
#define _G1IE_CMDFULIE_MASK                      0x00000002
#define _G1IE_CMDFULIE_LENGTH                    0x00000001

#define _G1IE_CMDLVIE_POSITION                   0x00000002
#define _G1IE_CMDLVIE_MASK                       0x00000004
#define _G1IE_CMDLVIE_LENGTH                     0x00000001

#define _G1IE_HMRGNIE_POSITION                   0x00000003
#define _G1IE_HMRGNIE_MASK                       0x00000008
#define _G1IE_HMRGNIE_LENGTH                     0x00000001

#define _G1IE_VMRGNIE_POSITION                   0x00000004
#define _G1IE_VMRGNIE_MASK                       0x00000010
#define _G1IE_VMRGNIE_LENGTH                     0x00000001

#define _G1IE_CHRIE_POSITION                     0x00000005
#define _G1IE_CHRIE_MASK                         0x00000020
#define _G1IE_CHRIE_LENGTH                       0x00000001

#define _G1IE_RCCIE_POSITION                     0x00000006
#define _G1IE_RCCIE_MASK                         0x00000040
#define _G1IE_RCCIE_LENGTH                       0x00000001

#define _G1IE_IPUIE_POSITION                     0x00000007
#define _G1IE_IPUIE_MASK                         0x00000080
#define _G1IE_IPUIE_LENGTH                       0x00000001

#define _G1IE_PUIE_POSITION                      0x0000000F
#define _G1IE_PUIE_MASK                          0x00008000
#define _G1IE_PUIE_LENGTH                        0x00000001

#define _G1IR_CMDMPTIF_POSITION                  0x00000000
#define _G1IR_CMDMPTIF_MASK                      0x00000001
#define _G1IR_CMDMPTIF_LENGTH                    0x00000001

#define _G1IR_CMDFULIF_POSITION                  0x00000001
#define _G1IR_CMDFULIF_MASK                      0x00000002
#define _G1IR_CMDFULIF_LENGTH                    0x00000001

#define _G1IR_CMDLVIF_POSITION                   0x00000002
#define _G1IR_CMDLVIF_MASK                       0x00000004
#define _G1IR_CMDLVIF_LENGTH                     0x00000001

