Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128DA106.h
#define _PMD2_IC3MD_POSITION                     0x0000000A
#define _PMD2_IC3MD_MASK                         0x00000400
#define _PMD2_IC3MD_LENGTH                       0x00000001

#define _PMD2_IC4MD_POSITION                     0x0000000B
#define _PMD2_IC4MD_MASK                         0x00000800
#define _PMD2_IC4MD_LENGTH                       0x00000001

#define _PMD2_IC5MD_POSITION                     0x0000000C
#define _PMD2_IC5MD_MASK                         0x00001000
#define _PMD2_IC5MD_LENGTH                       0x00000001

#define _PMD2_IC6MD_POSITION                     0x0000000D
#define _PMD2_IC6MD_MASK                         0x00002000
#define _PMD2_IC6MD_LENGTH                       0x00000001

#define _PMD2_IC7MD_POSITION                     0x0000000E
#define _PMD2_IC7MD_MASK                         0x00004000
#define _PMD2_IC7MD_LENGTH                       0x00000001

#define _PMD2_IC8MD_POSITION                     0x0000000F
#define _PMD2_IC8MD_MASK                         0x00008000
#define _PMD2_IC8MD_LENGTH                       0x00000001

#define _PMD3_I2C2MD_POSITION                    0x00000001
#define _PMD3_I2C2MD_MASK                        0x00000002
#define _PMD3_I2C2MD_LENGTH                      0x00000001

#define _PMD3_I2C3MD_POSITION                    0x00000002
#define _PMD3_I2C3MD_MASK                        0x00000004
#define _PMD3_I2C3MD_LENGTH                      0x00000001

#define _PMD3_U3MD_POSITION                      0x00000003
#define _PMD3_U3MD_MASK                          0x00000008
#define _PMD3_U3MD_LENGTH                        0x00000001

#define _PMD3_CRCMD_POSITION                     0x00000007
#define _PMD3_CRCMD_MASK                         0x00000080
#define _PMD3_CRCMD_LENGTH                       0x00000001

#define _PMD3_RTCCMD_POSITION                    0x00000009
#define _PMD3_RTCCMD_MASK                        0x00000200
#define _PMD3_RTCCMD_LENGTH                      0x00000001

#define _PMD3_CMPMD_POSITION                     0x0000000A
#define _PMD3_CMPMD_MASK                         0x00000400
#define _PMD3_CMPMD_LENGTH                       0x00000001

#define _PMD3_CRCPMD_POSITION                    0x00000007
#define _PMD3_CRCPMD_MASK                        0x00000080
#define _PMD3_CRCPMD_LENGTH                      0x00000001

#define _PMD4_USB1MD_POSITION                    0x00000000
#define _PMD4_USB1MD_MASK                        0x00000001
#define _PMD4_USB1MD_LENGTH                      0x00000001

#define _PMD4_LVDMD_POSITION                     0x00000001
#define _PMD4_LVDMD_MASK                         0x00000002
#define _PMD4_LVDMD_LENGTH                       0x00000001

#define _PMD4_CTMUMD_POSITION                    0x00000002
#define _PMD4_CTMUMD_MASK                        0x00000004
#define _PMD4_CTMUMD_LENGTH                      0x00000001

#define _PMD4_REFOMD_POSITION                    0x00000003
#define _PMD4_REFOMD_MASK                        0x00000008
#define _PMD4_REFOMD_LENGTH                      0x00000001

#define _PMD4_U4MD_POSITION                      0x00000005
#define _PMD4_U4MD_MASK                          0x00000020
#define _PMD4_U4MD_LENGTH                        0x00000001

#define _PMD4_UPWMMD_POSITION                    0x00000006
#define _PMD4_UPWMMD_MASK                        0x00000040
#define _PMD4_UPWMMD_LENGTH                      0x00000001

#define _PMD5_OC9MD_POSITION                     0x00000000
#define _PMD5_OC9MD_MASK                         0x00000001
#define _PMD5_OC9MD_LENGTH                       0x00000001

#define _PMD5_IC9MD_POSITION                     0x00000008
#define _PMD5_IC9MD_MASK                         0x00000100
#define _PMD5_IC9MD_LENGTH                       0x00000001

#define _PMD6_SPI3MD_POSITION                    0x00000000
#define _PMD6_SPI3MD_MASK                        0x00000001
#define _PMD6_SPI3MD_LENGTH                      0x00000001

#define _PMD6_GFX1MD_POSITION                    0x00000006
#define _PMD6_GFX1MD_MASK                        0x00000040
#define _PMD6_GFX1MD_LENGTH                      0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register CONFIG4 (0x157f8)                               */

extern __attribute__((space(prog))) unsigned int _CONFIG4;
#define _CONFIG4(x) __attribute__((section("__CONFIG4.sec"),space(prog))) unsigned int _CONFIG4 = (x);

/*
** Only one invocation of CONFIG4 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG4.
** Multiple options may be combined, as shown:
**
** _CONFIG4( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register CONFIG3 (0x157fa)                               */

extern __attribute__((space(prog))) unsigned int _CONFIG3;
#define _CONFIG3(x) __attribute__((section("__CONFIG3.sec"),space(prog))) unsigned int _CONFIG3 = (x);

/*
** Only one invocation of CONFIG3 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG3.
** Multiple options may be combined, as shown:
**
** _CONFIG3( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Write Protection Flash Page Segment Boundary:
**     WPFP_WPFP0           Page 0 (0x00)
**     WPFP_WPFP1           Page 1 (0x400)
**     WPFP_WPFP2           Page 2 (0x800)
**     WPFP_WPFP3           Page 3 (0xC00)
**     WPFP_WPFP4           Page 4 (0x1000)
**     WPFP_WPFP5           Page 5 (0x1400)
**     WPFP_WPFP6           Page 6 (0x1800)
**     WPFP_WPFP7           Page 7 (0x1C00)
**     WPFP_WPFP8           Page 8 (0x2000)
**     WPFP_WPFP9           Page 9 (0x2400)
**     WPFP_WPFP10          Page 10 (0x2800)
**     WPFP_WPFP11          Page 11 (0x2C00)
**     WPFP_WPFP12          Page 12 (0x3000)
**     WPFP_WPFP13          Page 13 (0x3400)
**     WPFP_WPFP14          Page 14 (0x3800)
**     WPFP_WPFP15          Page 15 (0x3C00)
**     WPFP_WPFP16          Page 16 (0x4000)
**     WPFP_WPFP17          Page 17 (0x4400)
**     WPFP_WPFP18          Page 18 (0x4800)
**     WPFP_WPFP19          Page 19 (0x4C00)
**     WPFP_WPFP20          Page 20 (0x5000)
**     WPFP_WPFP21          Page 21 (0x5400)
**     WPFP_WPFP22          Page 22 (0x5800)
**     WPFP_WPFP23          Page 23 (0x5C00)
**     WPFP_WPFP24          Page 24 (0x6000)
**     WPFP_WPFP25          Page 25 (0x6400)
**     WPFP_WPFP26          Page 26 (0x6800)
**     WPFP_WPFP27          Page 27 (0x6C00)
**     WPFP_WPFP28          Page 28 (0x7000)
**     WPFP_WPFP29          Page 29 (0x7400)
**     WPFP_WPFP30          Page 30 (0x7800)
**     WPFP_WPFP31          Page 31 (0x7C00)
**     WPFP_WPFP32          Page 32 (0x8000)
**     WPFP_WPFP33          Page 33 (0x8400)
**     WPFP_WPFP34          Page 34 (0x8800)
**     WPFP_WPFP35          Page 35 (0x8C00)
**     WPFP_WPFP36          Page 36 (0x9000)
**     WPFP_WPFP37          Page 37 (0x9400)
**     WPFP_WPFP38          Page 38 (0x9800)
**     WPFP_WPFP39          Page 39 (0x9C00)
**     WPFP_WPFP40          Page 40 (0xA000)
**     WPFP_WPFP41          Page 41 (0xA400)
**     WPFP_WPFP42          Page 42 (0xA800)
**     WPFP_WPFP43          Page 43 (0xAC00)
**     WPFP_WPFP44          Page 44 (0xB000)
**     WPFP_WPFP45          Page 45 (0xB400)
**     WPFP_WPFP46          Page 46 (0xB800)
**     WPFP_WPFP47          Page 47 (0xBC00)
**     WPFP_WPFP48          Page 48 (0xC000)
**     WPFP_WPFP49          Page 49 (0xC400)
**     WPFP_WPFP50          Page 50 (0xC800)
**     WPFP_WPFP51          Page 51 (0xCC00)
**     WPFP_WPFP52          Page 52 (0xD000)
**     WPFP_WPFP53          Page 53 (0xD400)
**     WPFP_WPFP54          Page 54 (0xD800)
**     WPFP_WPFP55          Page 55 (0xDC00)
**     WPFP_WPFP56          Page 56 (0xE000)
**     WPFP_WPFP57          Page 57 (0xE400)
**     WPFP_WPFP58          Page 58 (0xE800)
**     WPFP_WPFP59          Page 59 (0xEC00)
**     WPFP_WPFP60          Page 60 (0xF000)
**     WPFP_WPFP61          Page 61 (0xF400)
**     WPFP_WPFP62          Page 62 (0xF800)
**     WPFP_WPFP63          Page 63 (0xFC00)
**     WPFP_WPFP64          Page 64 (0x10000)
**     WPFP_WPFP65          Page 65 (0x10400)
**     WPFP_WPFP66          Page 66 (0x10800)
**     WPFP_WPFP67          Page 67 (0x10C00)
**     WPFP_WPFP68          Page 68 (0x11000)
**     WPFP_WPFP69          Page 69 (0x11400)
**     WPFP_WPFP70          Page 70 (0x11800)
**     WPFP_WPFP71          Page 71 (0x11C00)
**     WPFP_WPFP72          Page 72 (0x12000)
**     WPFP_WPFP73          Page 73 (0x12400)
**     WPFP_WPFP74          Page 74 (0x12800)
**     WPFP_WPFP75          Page 75 (0x12C00)
**     WPFP_WPFP76          Page 76 (0x13000)
**     WPFP_WPFP77          Page 77 (0x13400)
**     WPFP_WPFP78          Page 78 (0x13800)
**     WPFP_WPFP79          Page 79 (0x13C00)
**     WPFP_WPFP80          Page 80 (0x14000)
**     WPFP_WPFP81          Page 81 (0x14400)
**     WPFP_WPFP82          Page 82 (0x14800)
**     WPFP_WPFP83          Page 83 (0x14C00)
**     WPFP_WPFP84          Page 84 (0x15000)
**     WPFP_WPFP85          Page 85 (0x15400)
**     WPFP_WPFP255         Highest Page (same as page 85)
**
**   Secondary Oscillator Power Mode Select:
**     SOSCSEL_EC           External clock (SCLKI) or Digital I/O mode(
**     SOSCSEL_LPSOSC       Secondary oscillator is in Low-Power (low drive strength) Oscillator mode
**     SOSCSEL_SOSC         Secondary oscillator is in Default (high drive strength) Oscillator mode
**
**   Voltage Regulator Wake-up Time Select:
**     WUTSEL_FST           Fast regulator start-up time is used
**     WUTSEL_LEG           Default regulator start-up time is used
**
**   Alternate PMP Pin Mapping:
**     ALTPMP_ALTPMPEN      EPMP pins are in alternate location mode
**     ALTPMP_ALPMPDIS      EPMP pins are in default location mode
**
**   Segment Write Protection Disable:
**     WPDIS_WPEN           Segmented code protection is enabled; protected segment is defined by the WPEND, WPCFG and WPFPx Configuration bits
**     WPDIS_WPDIS          Segmented code protection is disabled
**
**   Write Protect Configuration Page Select:
**     WPCFG_WPCFGEN        Last page and Flash Configuration Words are write-protected, provided WPDIS = 0
**     WPCFG_WPCFGDIS       Last page (at the top of program memory) and Flash Configuration Words are not write-protected
**
**   Segment Write Protection End Page Select:
**     WPEND_WPSTARTMEM     Protected code segment lower boundary is at the bottom of the program memory (000000h); upper boundary is the code page specified by WPFP
**     WPEND_WPENDMEM       Protected code segment upper boundary is at the last page of program memory; the lower boundary is the code page specified by WPFP
**
*/

#define WPFP_WPFP0           0xFF00
#define WPFP_WPFP1           0xFF01
#define WPFP_WPFP2           0xFF02
#define WPFP_WPFP3           0xFF03
#define WPFP_WPFP4           0xFF04
#define WPFP_WPFP5           0xFF05
#define WPFP_WPFP6           0xFF06
#define WPFP_WPFP7           0xFF07
#define WPFP_WPFP8           0xFF08
#define WPFP_WPFP9           0xFF09
#define WPFP_WPFP10          0xFF0A
#define WPFP_WPFP11          0xFF0B
#define WPFP_WPFP12          0xFF0C
#define WPFP_WPFP13          0xFF0D
#define WPFP_WPFP14          0xFF0E
#define WPFP_WPFP15          0xFF0F
#define WPFP_WPFP16          0xFF10
#define WPFP_WPFP17          0xFF11
#define WPFP_WPFP18          0xFF12
#define WPFP_WPFP19          0xFF13
#define WPFP_WPFP20          0xFF14
#define WPFP_WPFP21          0xFF15
#define WPFP_WPFP22          0xFF16
#define WPFP_WPFP23          0xFF17
#define WPFP_WPFP24          0xFF18
#define WPFP_WPFP25          0xFF19
#define WPFP_WPFP26          0xFF1A
#define WPFP_WPFP27          0xFF1B
#define WPFP_WPFP28          0xFF1C
#define WPFP_WPFP29          0xFF1D
#define WPFP_WPFP30          0xFF1E
#define WPFP_WPFP31          0xFF1F
#define WPFP_WPFP32          0xFF20
#define WPFP_WPFP33          0xFF21
#define WPFP_WPFP34          0xFF22
#define WPFP_WPFP35          0xFF23
#define WPFP_WPFP36          0xFF24
#define WPFP_WPFP37          0xFF25
#define WPFP_WPFP38          0xFF26
#define WPFP_WPFP39          0xFF27
#define WPFP_WPFP40          0xFF28
#define WPFP_WPFP41          0xFF29
#define WPFP_WPFP42          0xFF2A
#define WPFP_WPFP43          0xFF2B
#define WPFP_WPFP44          0xFF2C
#define WPFP_WPFP45          0xFF2D
#define WPFP_WPFP46          0xFF2E
#define WPFP_WPFP47          0xFF2F
#define WPFP_WPFP48          0xFF30
#define WPFP_WPFP49          0xFF31
#define WPFP_WPFP50          0xFF32
#define WPFP_WPFP51          0xFF33
#define WPFP_WPFP52          0xFF34
#define WPFP_WPFP53          0xFF35
#define WPFP_WPFP54          0xFF36
#define WPFP_WPFP55          0xFF37
#define WPFP_WPFP56          0xFF38
#define WPFP_WPFP57          0xFF39
#define WPFP_WPFP58          0xFF3A
#define WPFP_WPFP59          0xFF3B
#define WPFP_WPFP60          0xFF3C
#define WPFP_WPFP61          0xFF3D
#define WPFP_WPFP62          0xFF3E
#define WPFP_WPFP63          0xFF3F
#define WPFP_WPFP64          0xFF40
#define WPFP_WPFP65          0xFF41
#define WPFP_WPFP66          0xFF42
#define WPFP_WPFP67          0xFF43
#define WPFP_WPFP68          0xFF44
#define WPFP_WPFP69          0xFF45
#define WPFP_WPFP70          0xFF46
#define WPFP_WPFP71          0xFF47
#define WPFP_WPFP72          0xFF48
#define WPFP_WPFP73          0xFF49
#define WPFP_WPFP74          0xFF4A
#define WPFP_WPFP75          0xFF4B
#define WPFP_WPFP76          0xFF4C
#define WPFP_WPFP77          0xFF4D
#define WPFP_WPFP78          0xFF4E
#define WPFP_WPFP79          0xFF4F
#define WPFP_WPFP80          0xFF50
#define WPFP_WPFP81          0xFF51
#define WPFP_WPFP82          0xFF52
#define WPFP_WPFP83          0xFF53
#define WPFP_WPFP84          0xFF54
#define WPFP_WPFP85          0xFF55
#define WPFP_WPFP255         0xFFFF

